
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/AI1411/terraform-ecs/actions/runs/4633263246)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-01e8f0711944f630e]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e045ce1b00c1ae71]
aws_ecr_repository.ecr_repository: Refreshing state... [id=golang-simple-grpc-server]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09546da07a4d3a277]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=golang-simple-grpc-server]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d3200ffc3ea6afea]
aws_security_group.alb: Refreshing state... [id=sg-0913f06e7e46d9d88]
aws_security_group.ecs: Refreshing state... [id=sg-072ed778c4dcf4979]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:targetgroup/golang-simple-grpc-server-tg/6d51f00e08691e38]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08bd2e8d1f95541a0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b14a6d3c53e3d5f7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02e8ee5062f5fe950]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02b5539fe45e6327b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04f10a644e50be262]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-034910cb1cab13f5d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03b1e0e9db27f8104]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1318507288]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0053b16448220511f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0e9905288523882a7]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:loadbalancer/app/golang-simple-grpc-server-alb/283f2e95656ad05f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-018706a2db074f9f1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf2e0c94a12ca98a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc05b5fb1b3132df]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-017b30897b472f820]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03b1e0e9db27f81041080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d3200ffc3ea6afea1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04f10a644e50be2621080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:listener/app/golang-simple-grpc-server-alb/283f2e95656ad05f/1340e81c30d6da98]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:listener-rule/app/golang-simple-grpc-server-alb/283f2e95656ad05f/1340e81c30d6da98/60202c9acb8e5e97]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/golang-simple-grpc-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "golang-simple-grpc-server"
      + tags_all           = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "golang-simple-grpc-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "golang-simple-grpc-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:targetgroup/golang-simple-grpc-server-tg/6d51f00e08691e38"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-072ed778c4dcf4979",
            ]
          + subnets          = [
              + "subnet-02b5539fe45e6327b",
              + "subnet-034910cb1cab13f5d",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/golang-simple-grpc-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "golang-simple-grpc-server"
                        }
                    }
                  + name             = "golang-simple-grpc-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "golang-simple-grpc-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "golang-simple-grpc-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "golang-simple-grpc-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "golang-simple-grpc-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creation complete after 1s [id=golang-simple-grpc-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=golang-simple-grpc-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=golang-simple-grpc-server-ecs-20230406213748608400000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 2s [id=/aws/ecs/golang-simple-grpc-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=golang-simple-grpc-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:459535173592:cluster/golang-simple-grpc-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:459535173592:service/golang-simple-grpc-server/golang-simple-grpc-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"ff7b1c504a6efb802b7389756162b70409f80a92","Vars":{},"WorkflowName":"Terraform"} -->